Pandas- DataFrame And Series 
Pandas is powerful data manipulation library in python , widely used for data analysis and data cleaning 
it provides two primary data structures :Series and DataFrame . A Series is a one- dimensional array-like Object, while a DataFrame is a two -dementional , size mutable, and Potentially heterogeneous tabular data structure with labeled axes(row and columns )

In [3]:
## A pandas Series is a one-dimensional labeled array-like object that can hold any data type.  it is similar to a column in a table or a single column in a DataFrame.

import pandas as pd
data =[1, 2, 3, 4, 5]
series = pd.Series(data)
print("Series \n " ,series)
print("Data type of Series: ", series.dtype,type(series))

Series
  0    1
1    2
2    3
3    4
4    5
dtype: int64
Data type of Series:  int64 <class 'pandas.core.series.Series'>

In [4]:
## Create  a Series  from  a dictionary 
data = {'a': 10, 'b': 20, 'c': 30}
series_dict= pd.Series(data)
print("\n Series from dictionary \n ", series_dict)

 Series from dictionary
  a    10
b    20
c    30
dtype: int64

In [5]:
data = [10,20,30,]
index = ['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [6]:
# A Series is a 1D labeled array

# Creating a Series from a list
temperatures = pd.Series([72, 75, 68, 80, 77])
print("Simple Series:")
print(temperatures)
print()

Simple Series:
0    72
1    75
2    68
3    80
4    77
dtype: int64

In [8]:

# Creating a Series with custom labels (index)
temperatures_labeled = pd.Series([72, 75, 68, 80, 77], 
                                 index=['Mon', 'Tue', 'Wed', 'Thu', 'Fri'])
print("Series with custom index:")
print(temperatures_labeled)
print()

# Accessing values
print("Temperature on Wednesday:", temperatures_labeled['Wed'])

Series with custom index:
Mon    72
Tue    75
Wed    68
Thu    80
Fri    77
dtype: int64

Temperature on Wednesday: 68

In [18]:
# ========== DATAFRAME ==========
# A DataFrame is a 2D table with rows and columns

# Creating a DataFrame from a dictionary
# Each key becomes a column name, each value is a Series
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Age': [25, 30, 35, 28],
    'City': ['New York', 'Paris', 'London', 'Tokyo']
}

df = pd.DataFrame(data)
print("DataFrame:")
print(df)
import numpy as np
np.array(df)

DataFrame:
      Name  Age      City
0    Alice   25  New York
1      Bob   30     Paris
2  Charlie   35    London
3    Diana   28     Tokyo

array([['Alice', 25, 'New York'],
       ['Bob', 30, 'Paris'],
       ['Charlie', 35, 'London'],
       ['Diana', 28, 'Tokyo']], dtype=object)

In [16]:
# Accessing a column (returns a Series)
print("The 'Age' column (a Series):")
print(df['Age'])

The 'Age' column (a Series):
0    25
1    30
2    35
3    28
Name: Age, dtype: int64

In [21]:
# Accessing a row by index position
print("First row:")
print(df.iloc[0])
print()

First row:
Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [25]:

# Adding a new column
df['Country'] = ['USA', 'France', 'UK']
print("DataFrame with new column:")
print(df)
print()

DataFrame with new column:
      Name  Age      City Country
0    Alice   25  New York     USA
1      Bob   30     Paris  France
2  Charlie   35    London      UK

In [26]:
# Basic operations
print("Average age:", df['Age'].mean())
print("Max age:", df['Age'].max())

Average age: 30.0
Max age: 35

In [48]:
## creating a data frame from a list of dictionaries
data = [
    {'Name': 'Alice', 'Age': 25, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 30, 'City': 'Paris'},
    {'Name': 'Charlie', 'Age': 35, 'City': 'London'}
]
df = pd.DataFrame(data)
print("DataFrame from list of dictionaries:")
print(df)

DataFrame from list of dictionaries:
      Name  Age      City
0    Alice   25  New York
1      Bob   30     Paris
2  Charlie   35    London

In [105]:
df = pd.read_csv('Ds_salaries.csv')
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2021,MI,FT,Data Scientist,30400000,CLP,40038,CL,100,CL,L
1,2021,MI,FT,BI Data Analyst,11000000,HUF,36259,HU,50,US,L
2,2020,MI,FT,Data Scientist,11000000,HUF,35735,HU,50,HU,L
3,2021,MI,FT,ML Engineer,8500000,JPY,77364,JP,50,JP,S
4,2022,SE,FT,Lead Machine Learning Engineer,7500000,INR,95386,IN,50,IN,L

In [106]:
df.iloc[0]

work_year                       2021
experience_level                  MI
employment_type                   FT
job_title             Data Scientist
salary                      30400000
salary_currency                  CLP
salary_in_usd                  40038
employee_residence                CL
remote_ratio                     100
company_location                  CL
company_size                       L
Name: 0, dtype: object

In [94]:
df.iloc[0][0]

C:\Users\dell\AppData\Local\Temp\ipykernel_4512\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

np.int64(2021)

In [107]:
## Accessing the first element of the first row
df.iloc[0][0]

C:\Users\dell\AppData\Local\Temp\ipykernel_4512\1103262492.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

np.int64(2021)

In [108]:
df

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2021,MI,FT,Data Scientist,30400000,CLP,40038,CL,100,CL,L
1,2021,MI,FT,BI Data Analyst,11000000,HUF,36259,HU,50,US,L
2,2020,MI,FT,Data Scientist,11000000,HUF,35735,HU,50,HU,L
3,2021,MI,FT,ML Engineer,8500000,JPY,77364,JP,50,JP,S
4,2022,SE,FT,Lead Machine Learning Engineer,7500000,INR,95386,IN,50,IN,L
...,...,...,...,...,...,...,...,...,...,...,...
14833,2022,MI,FT,Business Intelligence Developer,15000,USD,15000,GH,100,GH,M
14834,2020,EX,FT,Staff Data Analyst,15000,USD,15000,NG,0,CA,M
14835,2021,EN,FT,Machine Learning Developer,15000,USD,15000,TH,100,TH,L
14836,2022,EN,FT,Data Analyst,15000,USD,15000,ID,0,ID,L
14837,2020,EN,PT,ML Engineer,14000,EUR,15966,DE,100,DE,S

In [109]:
# Accessing a specific element in the DataFrame (row 0, column 'job_title')
specific_element_df = df.iloc[0]['job_title']
print("Specific element from DataFrame:", specific_element_df)

# Accessing a specific element in the Series (index 'b')
specific_element_series = series_dict['b']
print("Specific element from Series:", specific_element_series)

Specific element from DataFrame: Data Scientist
Specific element from Series: 25

In [110]:
# Assign a new value to a specified DataFrame element (row 0, column 'job_title')
df.at[0, 'job_title'] = 'Senior Data Scientist'
specific_element_df = df.at[0, 'job_title']
print("Updated DataFrame element (row 0, 'job_title'):", specific_element_df)

# Assign a new value to a specified Series element (index 'b')
series_dict.at['b'] = 25
specific_element_series = series_dict.at['b']
print("Updated Series element (index 'b'):", specific_element_series)

# Quick confirmation prints
# Do not overwrite df; read the series value instead
value_b = series_dict.at['b'] if 'b' in series_dict.index else None
print("Value at series_dict['b']:", value_b)

# Quick confirmation prints (safe)
if 'job_title' in df.columns:
    print(df.loc[0, ['job_title']])
print(series_dict)

Updated DataFrame element (row 0, 'job_title'): Senior Data Scientist
Updated Series element (index 'b'): 25
Value at series_dict['b']: 25
job_title    Senior Data Scientist
Name: 0, dtype: object
a    10
b    25
c    30
dtype: int64